# ViewSolarstudyLightingAltitudeValue Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterTypeId..::..ViewSolarstudyLightingAltitudeValue Property
ParameterTypeId Class See Also
---
"Lighting altitude"
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId ViewSolarstudyLightingAltitudeValue { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property ViewSolarstudyLightingAltitudeValue As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ ViewSolarstudyLightingAltitudeValue {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace